[
  {
    "name": "Marinara Sauce With Hidden Veggies",
    "ingredients": "Olive oil 2 cups carrots, \n chopped 4 cups onion, chopped 2 cups red pepper, \n chopped 2 cups celery, chopped 5 cloves garlic, \n sliced 2 tablespoons oregano \n 2 tablespoons basil \n 1½ cup tomato paste \n 8 cups whole peeled tomatoes \n 2 cups water Salt Pepper",
    "instructions": "In a large pot at medium-high heat, add the olive oil and carrots to the pot. \n Cook the carrots for about 10 minutes until they start to brown slightly. \n Next add the chopped onion, red bell pepper, celery, garlic, oregano, basil, salt, and pepper to the pot and cook until the vegetables are caramelized and tender. \n Add the tomato paste, stir it into the vegetables, and allow the tomato paste to brown deeply. It should be very aromatic before moving forward.\nAdd the canned tomatoes, bring the sauce to a boil, and then reduce to a simmer.\nSimmer the sauce for at least 1 hour.\nAdd the sauce to a blender in batches or use an immersion blender to puree the sauce to your desired consistency.\nLet the sauce cool completely and then pour the sauce into freezer-safe bags.\nPlace the bags into a leak-proof container/tray, and freeze for up to one month.\nReheat the frozen sauce with ½ cup of water in a pot until it comes to a boil and then use as desired.\nEnjoy!",
    "user": ""
  },
  {
    "name": "Healthy Mac & Cheese",
    "ingredients": "1 pound elbow macaroni, cooked al dente \n ½ cup water 1-2 cups cauliflower florets 1-2 cups butternut squash, diced 1-2 cups carrots, sliced 2 cups milk 2 cups cheddar cheese, \n shredded 4 ounces cream cheese ",
    "instructions": "Add water, cauliflower, squash, and carrots in a pot over medium heat. \n Cover and cook until vegetables are tender. \n Add everything into a blender, including cooking water, and blend until smooth. \n Return blended veggies to the pot over medium heat, and add the milk, cheese, and cream cheese. Stir until smooth. \n Add macaroni, reduce heat, mix thoroughly, and cover for 20 minutes. Enjoy!",
    "user": ""
  },
  {
    "name": "Burgers With Hidden Veggies",
    "ingredients": "2 pounds ground beef \n 1 tablespoon salt \n 1 teaspoon black pepper \n 1 teaspoon garlic powder \n 1 teaspoon onion powder \n 2 carrots, shredded \n 2 heads broccoli, shredded \n 12 slices cheddar cheese \n 12 burger buns",
    "instructions": "1. In a large bowl, \n season the beef with salt, \n pepper, \n garlic powder, \n and onion powder. \n 2. Shred the carrots and broccoli using a box grater.\n 3. Add the carrots and broccoli to the bowl with the beef and mix well with a spoon or your hands. \n 4. Form meat into patties and either pan-fry or grill until cooked. \n Top with cheese and let it melt. \n 5. Assemble burger with your favorite toppings. \n 6. Enjoy! ",
    "user": ""
  },
  {
    "name": "Chicken & Rice",
    "ingredients": "5 chicken thighs \n ½ teaspoon salt \n ¼ teaspoon pepper \n ½ teaspoon garlic powder \n ½ teaspoon paprika\n½ teaspoon dried basil \n ½ teaspoon dried oregano \n 2 zucchinis, grated \n 1 cup rice \n ½ teaspoon garlic powder \n Salt, to taste \n Pepper, to taste \n 1½ cups chicken broth",
    "instructions": "1. Preheat oven to 400˚F/200˚C. \n 2. Season the chicken thighs in a bowl with salt, pepper, garlic powder, paprika, dried basil, and dried oregano. Mix until thoroughly coated with the season \n 3. On high, heat olive oil in a ovenproof pot and place chicken thighs, skin-side down, in the hot oil. Cook 3-4 minutes or until the thighs develop brown crispy skin, and flip over. Cook an additional 2-3 minutes to brown the other side, and remove from the  \n 4. Grate both zucchinis with a box gra \n 5. Add the grated zucchini into the pot, along with rice, garlic powder, salt, pepper, and chicken broth. Bring to a b \n 6. Lay the chicken on top of the rice mixture and cov \n 7. Bake for 30 minutes or until the chicken’s internal temperature reads 165˚F/7 \n 8. Optional: Remove chicken and broil 1-2 minutes to crisp skin even m \n 9.  Enjoy!",
    "user": ""
  },
  {
    "name": "Veggie Nuggets",
    "ingredients": "3 carrots, peeled & cut into chunks ½ head cauliflower, \n broken up 1 head broccoli, \n broken up 2 cloves garlic, chopped \n 1 egg ½ teaspoon onion powder \n 1 teaspoon salt \n ½ teaspoon pepper \n 1¾ cup plain bread crumbs",
    "instructions": "1. In a food processor, blend carrots, cauliflower, broccoli, garlic, egg, onion powder, \n salt, and pepper until combined. \n 2. Add 1¼ cup of bread crumbs and blend just until incorporated. \n 3. Scoop a tablespoon of the mixture and form a small circular shaped “nugget.” \n 4. Place the remaining ½ cup of bread crumbs in a bowl and cover each nugget with the bread crumbs. \n 5. Either pan fry with a small drizzle of oil over medium-high heat until both sides are golden brown, about 10 minutes. \n Or you can bake them on a piece of parchment paper at 400˚F/200˚C for 25 minutes, flipping after the first 15 minutes. \n 6. Serve with your favorite dipping sauce. \n 7. Enjoy!",
    "user": ""
  },
  {
    "name": "Hidden Veggie Meatballs",
    "ingredients": "1 large carrot, shredded \n 1 zucchini, shredded \n1 pound ground beef \n 1 pound ground pork \n ¼ cup parmesan, grated \n ¼ cup onion, minced \n ¼ cup parsley, minced \n 2 teaspoons salt \n 1 teaspoon pepper \n 1 teaspoon garlic powder \n 2 eggs \n 1 cup bread crumbs \n 16 oz of marinara sauce",
    "instructions": "1. Place shredded carrot and zucchini on a clean towel and wring out as much liquid as possible. \n 2. Place strained carrot and zucchini in a bowl and add ground beef, ground pork, parmesan, onion, parsley, salt, pepper, garlic powder, and eggs. Mix until just combined. \n 3. Grab about a ¼ cup of the mixture and roll into a ball.  \n 4. Either pan-fry the meatballs over medium-high heat until all sides are golden brown, about 10 minutes, and pour marinara sauce into the pan. Simmer for 10-15 minutes. \n Or you can bake them on a piece of parchment paper at 250˚F/180˚C for 30-35 minutes, flipping after the first 15 minutes. \n Warm up marinara sauce on the side. \n 5. Serve with cooked spaghetti and parmesan cheese. \n 6. Enjoy!",
    "user": ""
  },
  {
    "name": "Carrot and Chickpea Veggie Burger",
    "ingredients": "15.5 ounces chickpeas, drained & rinsed \n 1½ cups oats \n ½ cup shredded carrots \n ½ cup diced red onion \n 1 egg \n 1 teaspoon salt \n ½ teaspoon pepper \n ½ teaspoon garlic powder \n 1 teaspoon olive oil \n ½ lemon, juiced \n 1 tablespoon olive oil ",
    "instructions": "1. In a food processor, combine chickpeas, oats, carrots, red onion, egg, salt, pepper, garlic powder, and olive oil. Blend just until combined. \n 2. Add lemon juice and blend again until well-combined. \n 3. Scoop the mixture using a ⅓ cup measuring cup and form patty in your hands. \n 4. Heat a tablespoon of olive oil over medium-high heat. Cook the patty 4-5 minutes on each side, or until golden brown. \n 5. Assemble with your favorite burger toppings. \n 6. Enjoy!",
    "user": ""
  },
  {
    "name": "Cauliflour Tots",
    "ingredients": "16 ounces cauliflower, minced  \n 1 egg \n ⅔ bread crumbs \n 1 cup cheddar cheese, shredded \n 1 cup parmesan cheese, shredded \n 2 large garlic cloves, minced \n ¼ teaspoon salt ",
    "instructions": "1.  Preheat your oven to 400°F/200°C. \n 2.  Fill a saucepan with water and bring to a boil. Aggressively season it with salt.  Blanch the cauliflower in boiling water for about 5 minutes. Drain and finely chop the cooked cauliflower. \n 3.  In a mixing bowl, add cauliflower, egg, bread crumbs, cheddar cheese, parmesan cheese, garlic, and salt.  \n 4.  Chill in the refrigerator for 15-20 minutes. \n 5.  Spray a nonstick baking sheet with nonstick spray. Shape the mixture into tot shapes and spread them evenly on the sheet \n 6.  Bake for 10 minutes at 400°F/200°C. Flip and then bake for an additional 10 minutes on the other side until golden brown \n 7.  Enjoy!",
    "user": ""
  },
  {
    "name": "Chicken & Broccoli Alfredo Stuffed Shells",
    "ingredients": "2 cups rotisserie chicken, diced \n 2 cups cooked broccoli, cut into small florets \n 15 oz alfredo sauce, 1/4 cup set aside \n 1 cup shredded mozzarella cheese, divided \n 24 jumbo shells, cooked al dente",
    "instructions": " 1. Preheat oven to 350°F/180°C \n 2. In a bowl, mix chicken, broccoli, alfredo sauce, and 1/2 cup mozzarella. \n 3. Stuff mixture into the jumbo shells, and place in rows in a greased 9x13 glass baking dish. \n 4. Spread on 1/4 cup alfredo sauce and sprinkle on remaining 1/2 cup mozzarella \n 5. Cover with foil and bake for 30 minutes.   \n 6. Garnish with fresh parsley.   \n 7. Enjoy!",
    "user": ""
  },
  {
    "name": "Frozen Yogurt Granola Cups",
    "ingredients": "1 Cup Granola \n 1 Tbsp. Butter (melted) \n 1 Tbsp. Honey \n 24 oz Yogurt of choice \n Fruit of choice (we used blackberries, raspberries, and chopped strawberries)",
    "instructions": "1. In a bowl, combine 1 cup granola, \n 1 Tbsp. melted butter, and 1 Tbsp. honey. \n Mix well. \n 2. Fill a muffin tin with cup liners and divide granola mixture across all, evenly covering the bottoms. \n Fill each cup with yogurt and top with fruit. \n Freeze for two or more hours.",
    "user": ""
  },
  {
    "name": "Cheddar Oven Baked Chicken",
    "ingredients": "3 cups cheese crackers, crushed \n ¼ teaspoon pepper, optional \n 2 cups flour \n 5 eggs, whisked \n 4 skin-on chicken drumsticks \n 4 skin-on chicken thighs \n 3 cups broccoli florets \n 3 cups yukon potatoes, quartered \n 3 tablespoons olive oil \n 2 tablespoons rosemary leaves, chopped \n 3 cloves garlic, minced \n ½ teaspoon salt \n ¼ teaspoon pepper \n Parsley, for garnish",
    "instructions": "1. Preheat oven to 425°F (220°C). \n 2. Place cheese crackers in a resealable bag and crush with a rolling pin until they become finely ground. Add pepper, if desired. \n 3. In a separate bowl, beat eggs until smooth. \n 4. Roll each chicken piece into flour and then coat into eggs. \n 5. Place each chicken piece in the cracker crumbs. Coat the chicken with the crumbs. \n 6. Arrange chicken pieces on a parchment-lined baking sheet. \n 7. In a medium bowl, combine broccoli and potatoes. Add olive oil, rosemary, and garlic. Toss until vegetables are well-coated. \n 8. Arrange vegetables on parchment-lined baking sheet. \n 9. Bake chicken and veggies for 35-40 minutes or until chicken is golden brown and cooked through. \n 10. Top chicken with parsley. \n 11. Enjoy!",
    "user": ""
  }
]
